SetBackground Method
 Sets the background for the view. Background can only be set for 3d views and for Sections/Elevations.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public void SetBackground(
	ViewDisplayBackground background
)
Visual Basic
Public Sub SetBackground ( _
	background As ViewDisplayBackground _
)
Visual C++
public:
void SetBackground(
	ViewDisplayBackground^ background
)
Parameters
background
Type: Autodesk.Revit.DBViewDisplayBackground
 Background to set. See 'ViewDisplayBackground' class and its 'create' methods.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentException |  The background object is invalid, or view has 'Rendering' style.
Autodesk.Revit.ExceptionsArgumentNullException |  A non-optional argument was null
Autodesk.Revit.ExceptionsInvalidOperationException |  This view does not contain display-related properties.
See Also
View Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →